Tekla Open API Reference for Tekla Structures 2025
Plugin.SetPickerInput Method
 Defines the sequence of inputs to use in place of interactive picks when the plug-in is inserted to a drawing.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public void SetPickerInput(
	PluginPickerInput Input
)
Public Sub SetPickerInput (
	Input As PluginPickerInput
)
Parameters
Input
Type: Tekla.Structures.Drawing.PluginPickerInput
The sequence of picks to provide to the plug-in at insertion.
See Also
Reference
Plugin Class
Tekla.Structures.Drawing Namespace